In [1]:
import numpy as np
import pandas as pd

In [2]:
data_one = { 'A': ['A0','A1','A2','A3'], 'B': ['B0','B1','B2','B3']}

In [3]:
data_two = { 'C': ['C0','C1','C2','C3'], 'D': ['D0','D1','d2','D3']}

In [4]:
one = pd.DataFrame(data=data_one)

In [5]:
two = pd.DataFrame(data=data_two)

In [6]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [7]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  d2
3  C3  D3

In [8]:
# Concatenate long the COLUMNS!
pd.concat([one,two],axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  d2
3  A3  B3  C3  D3

In [9]:
# Concatenate long the ROWS!
pd.concat([one,two])

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   d2
3  NaN  NaN   C3   D3

In [10]:
two.columns = one.columns

In [11]:
two

    A   B
0  C0  D0
1  C1  D1
2  C2  d2
3  C3  D3

In [12]:
mydf = pd.concat([one,two], axis=0)

In [13]:
mydf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  d2
3  C3  D3

In [14]:
mydf.index

Index([0, 1, 2, 3, 0, 1, 2, 3], dtype='int64')

## MERGE

### how='inner' => INNER JOIN

In [15]:
registrations = pd.DataFrame({'reg_id': [1,2,3,4], 'name': ['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id': [1,2,3,4], 'name': ['Xavier','Andrew','Yolanda','Bobo']})

In [16]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [17]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [18]:
# help(pd.merge)

In [19]:
pd.merge(registrations,logins,how='inner',on='name')

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

### how='' => LEFT and/or RIGHT JOIN

In [22]:
pd.merge(left=registrations,right=logins,how='left',on='name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [23]:
pd.merge(left=registrations,right=logins,how='right',on='name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

### Outer Condition